Repository: common-repository/jbauth-oauth-client
Catalog: langs/jbauth-oauth-client-*.po
Languages: de_de

source: This will add a Login Button to your menu
de_de: Platziere einen Login Button in dein Menü

source: You are not authorized to view this page.
de_de: Du bist nicht autorisiert diese Seite aufzurufen.

source: settings saved.
de_de: Einstellungen gespeichert.

source: JBAuth Authentication Plugin
de_de: JBAuth Authentifizierungs Erweiterung

source: by Justin René Back
de_de: von Justin René Back

source: Go to https://dev.justinback.com and create a new Application and API Key if you haven't already
de_de: Rufe https://dev.justinback.com auf, erstelle eine neue Anwendung und einen API Schlüssel wenn du keinen hast

source: Then enter the client id and secret from your Application below, the api key from the dashboard and save the changes
de_de: Gebe dann die Client ID und Secret von deiner Anwendung und den API Schlüssel in die Eingabefelder unten ein und speicher die Änderungen

source: API Key:
de_de: API Schlüssel:

source: Important: Make sure you have entered as authorized Url redirect, the following URI:
de_de: Wichtig: Stelle sicher dass du folgende URL in das Weiterleitungsfeld eingeben hast:

source: Check to allow user registration
de_de: Registrierung erlauben

source: If you allow that users can be registered through JBAuth, a user will be created after the login with JBAuth, if the user doesn't exists on the site.
de_de: Wenn du erlaubst, dass Benutzer sich via JBAuth registrieren dürfen, wird ein neuer Benutzer nach dem Login angelegt wenn dieser nicht bereits existiert.

source: Save Changes
de_de: Änderungen Speichern

source: As a widget: [jbauthbtn]
de_de: Als ein Widget: [jbauthbtn]

source: To put your button in a Widget use our Widget "jbauth Oauth Widget", where you can add a Title and a Description to your Button
de_de: Um den Login Button als Widget zu nutzen, kannst du das "jbauth Oauth Widget" benutzen, wo du den Titel und die Beschreibung ändern kannst

source: To add the JBAuth button directly to your php code, you can use <code>do_shortcode('[jbauthbtn]');</code>.
de_de: Um den JBAuth login button direkt via PHP zu nutzen, kannst du folgenden syntax benutzen: <code>do_shortcode('[jbauthbtn]');</code>.

source: To add it as a shortcode, just add [jbauthbtn]
de_de: Um den login button als Shortcode zu verwenden: [jbauthbtn]

source: An internal server error occurred while contacting JBAuth!<br><br><b>
de_de: Ein Server Fehler ist aufgetreten während wir versucht haben JBAuth zu kontaktieren!<br><br><b>

source: Your JBAuth account doesn't match any user on this page
de_de: Dein JBAuth Account existiert nicht auf dieser Seite

source: Error:
de_de: Fehler:

source: Title
de_de: Titel

source: Description
de_de: Beschreibung
